In [19]:
# Import
import pandas as pd
from sqlalchemy import create_engine
from geopy import geocoders

database_path = "../da_job_data.sqlite"

In [2]:
# Create Engine
engine = create_engine(f"sqlite:///{database_path}")
conn = engine.connect()

In [3]:
# Query All Records in the the Database
data = pd.read_sql("SELECT * FROM da_data", conn)

In [4]:
# Preview the Data
data.head()

,id,title,company_name,location,via,description,extensions,schedule_type,work_from_home,salary_hourly,salary_yearly,salary_standardized,description_tokens
0,1,title,company_name,location,via,description,extensions,schedule_type,work_from_home,salary_hourly,salary_yearly,salary_standardized,description_tokens
1,2,Data Analyst,Applicantz,Anywhere,via LinkedIn,Open to work on W2 or on Corp-to-Corp (for vis...,"['41 minutes ago', 'Work from home', 'Contract...",Contractor,TRUE,,,,"['qlik', 'power_bi', 'power_bi']"
2,3,Data Analyst I (Remote Optional),Talentify.io,Anywhere,via LinkedIn,Talentify helps candidates around the world to...,"['15 hours ago', 'Work from home', 'Full-time']",Full-time,TRUE,,,,['excel']
3,4,Data Analyst II,EDWARD JONES,"Whiteman AFB, MO",via Monster,"At Edward Jones, we help clients achieve their...","['24 hours ago', 'Full-time', 'Health insurance']",Full-time,,,,,"['sas', 'snowflake', 'excel', 'power_bi', 'pyt..."
4,5,Data Analyst,Rose International,United States,via Indeed,Position Title\nPosition Number\nLocation...\n...,['7 hours ago'],,,,,,"['excel', 'tableau', 'cognos', 'sql', 'word']"

In [5]:
#assess data information and types
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10498 entries, 0 to 10497
Data columns (total 13 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   id                   10498 non-null  int64
 1   title                10498 non-null  object
 2   company_name         10498 non-null  object
 3   location             10498 non-null  object
 4   via                  10498 non-null  object
 5   description          10498 non-null  object
 6   extensions           10498 non-null  object
 7   schedule_type        10498 non-null  object
 8   work_from_home       10498 non-null  object
 9   salary_hourly        10498 non-null  object
 10  salary_yearly        10498 non-null  object
 11  salary_standardized  10498 non-null  object
 12  description_tokens   10498 non-null  object
dtypes: int64(1), object(12)
memory usage: 1.0+ MB

In [6]:
#drop the duplicate title row
data = data.drop([0])

In [7]:
#update salary_hourly, salary_yearly, and salary_standardized to be type FLOAT
#data['salary_hourly'] = data['salary_hourly'].astype(float)

#unable to convert due to empty rows

In [8]:
#create new dataframe for top locations of job postings
post_source_df = data['via'].value_counts().rename_axis('post_source').reset_index(name='count')
post_source_df.head(10)

             post_source  count
0           via LinkedIn   3996
1             via Upwork   1400
2       via ZipRecruiter    644
3             via Indeed    563
4              via BeBee    329
5             via Adzuna    292
6        via Trabajo.org    280
7            via Monster    251
8           via Snagajob    213
9  via My ArkLaMiss Jobs    204

In [9]:
#create new dataframe for the locations of the job postings and the count of appearances in the dataset
location_df = data['location'].value_counts(dropna=True).rename_axis('location').reset_index(name='count')
location_df

               location  count
0              Anywhere   4883
1         United States   2280
2       Kansas City, MO    353
3     Oklahoma City, OK    253
4    Jefferson City, MO    207
..                  ...    ...
336         Shawnee, OK      1
337  Shawnee County, KS      1
338        Bismarck, AR      1
339       Chickasha, OK      1
340        Healdton, OK      1

[341 rows x 2 columns]

In [10]:
#filter out only locations with city and state provided for location mapping
clean_location_df = location_df[location_df['location'].str.contains(r'\w+,\s\w{2}')]
clean_location_df

               location  count
2       Kansas City, MO    353
3     Oklahoma City, OK    253
4    Jefferson City, MO    207
5             Tulsa, OK    129
6          Columbia, MO    124
..                  ...    ...
336         Shawnee, OK      1
337  Shawnee County, KS      1
338        Bismarck, AR      1
339       Chickasha, OK      1
340        Healdton, OK      1

[329 rows x 2 columns]

In [20]:
gn = geocoders.GeoNames()

print(gn.geocode("Shawnee, OK"))

TypeError: __init__() missing 1 required positional argument: 'username'

In [11]:
print(clean_location_df.to_string())

                    location  count
2            Kansas City, MO    353
3          Oklahoma City, OK    253
4         Jefferson City, MO    207
5                  Tulsa, OK    129
6               Columbia, MO    124
7                Wichita, KS    108
8          Overland Park, KS     93
9            Bentonville, AR     90
10                Topeka, KS     82
12           Springfield, MO     65
13            Springdale, AR     55
14           Kansas City, KS     46
15          Lee's Summit, MO     34
16         San Francisco, CA     32
17          Fayetteville, AR     31
18           Warrensburg, MO     29
19                Lenexa, KS     27
20               Dearing, KS     26
21                Rogers, AR     22
22                  Enid, OK     22
23                 Maize, KS     19
24            Fort Smith, AR     19
25                Edmond, OK     18
26                 Rolla, MO     18
27                Olathe, KS     16
28            Stillwater, OK     15
29          Bartlesville, OK     15
30          Midwest City, OK     14
31                 Dover, AR     14
33           The Village, OK     13
34           Bella Vista, AR     13
35                  Home, KS     13
36            California, MO     12
37            Warr Acres, OK     12
38               Shawnee, KS     12
39             Haysville, KS     12
40           Nicoma Park, OK     12
41                Elkins, AR     12
42                 Derby, KS     11
43                 Yukon, OK     11
44        New Bloomfield, MO     11
46              Gravette, AR     11
47               Mustang, OK     11
48               Andover, KS     10
49               Mulvane, KS     10
50              Bel Aire, KS     10
51         Missouri City, MO     10
52          Broken Arrow, OK     10
53          Higginsville, MO     10
54             Centralia, MO     10
55                  Duke, MO      9
56               Colwich, KS      9
57               Alameda, CA      9
58             St Joseph, MO      9
60                Benton, KS      9
61             Hartsburg, MO      9
62               Goddard, KS      9
63                 Kechi, KS      9
64             Park City, KS      9
65              Del City, OK      9
66               Spencer, OK      9
67                 Jones, OK      9
68             Houstonia, MO      9
69             Jamestown, MO      9
70             Cassville, MO      9
71                Dallas, AR      9
72                   All, MO      9
73             Greenland, AR      9
74         Edgar Springs, MO      8
75             Tontitown, AR      8
76             Centerton, AR      8
78             Rose Hill, KS      8
79                Norman, OK      8
80                Goshen, AR      8
81       Cammack Village, AR      8
82         Sweet Springs, MO      8
83                Lowell, AR      8
84         Mountain View, CA      8
85               Decatur, AR      7
86             Nashville, AR      7
87                 Moore, OK      7
88                Odessa, MO      7
89              St James, MO      7
90            Centertown, MO      7
91             Pea Ridge, AR      7
92            Clearwater, KS      7
93          Cave Springs, AR      7
94           Minneapolis, KS      7
95          Valley Brook, OK      7
96         McConnell AFB, KS      7
97                Duncan, OK      7
98         Valley Center, KS      7
99               Oakland, CA      7
100              Newburg, MO      7
101         Independence, MO      7
102               Eugene, MO      7
103        Mountain Home, AR      6
104               Bruner, MO      6
105              Arcadia, OK      6
106                Belle, MO      6
107               Vienna, MO      6
108          Little Rock, AR      6
109               Holden, MO      6
110           Bates City, MO      6
111              Willard, MO      6
112          Elm Springs, AR      6
113                 Linn, MO      6
114         Devils Elbow, MO      6
115             Fordland, MO      6
116             Anderson, MO      6
117          Rogersville, MO      6
118                 Nixa, MO      6
119            St Thomas, MO      6
120              Calhoun, MO      6
121                 Noel, MO      6
122               Conway, AR      6
123          Leavenworth, KS      6
125            Brinktown, MO      5
126               Madill, OK      5
127          Lake Spring, MO      5
128         St Elizabeth, MO      5
129                Wesco, MO      5
130              Johnson, AR      5
131             San Jose, CA      5
132              Mayview, MO      5
133          Knob Noster, MO      5
134             Freeburg, MO      5
135            Chilhowee, MO      5
136           Kingsville, MO      5
137              Ashland, MO      5
138               Tuttle, OK      5
139              Bentley, KS      5
140                 Emma, MO      5
141          Loose Creek, MO      5
142           Lone Grove, OK      5
143              Choctaw, OK      5
144              Turners, MO      5
145               Fulton, MO      4
146            Manhattan, KS      4
147           Marshfield, MO      4
148         Bonnots Mill, MO      4
149           Fair Grove, MO      4
150            Boonville, MO      4
151              Lincoln, KS      4
152             La Monte, MO      4
153              Windsor, MO      4
154                Dixon, MO      4
155            Claremore, OK      4
156           Sacramento, CA      4
157             New Home, MO      4
158            Sunnyvale, CA      4
159            Palo Alto, CA      4
160              Branson, MO      4
161         Walnut Grove, MO      4
162                Vichy, MO      4
163             Auxvasse, MO      4
164               Higbee, MO      4
165         Whiteman AFB, MO      4
166                Crane, MO      4
167                 Meta, MO      4
168         New Franklin, MO      4
169              Sherman, TX      4
170          Honey Grove, TX      4
171         Kingdom City, MO      4
172             Piedmont, OK      4
173              Mission, KS      4
174               Beulah, MO      4
175              Leawood, KS      4
176            St Robert, MO      4
177             Sturgeon, MO      4
178           Farmington, AR      4
179               Leeton, MO      3
180              Bethany, OK      3
181              Waurika, OK      3
182            Pittsburg, KS      3
183             Stanford, CA      3
184            Pottsboro, TX      3
185               Bonham, TX      3
186               Calera, OK      3
187               Helena, MO      3
188             Tebbetts, MO      3
189                 Alma, MO      3
190            Rocheport, MO      3
191         Cook Station, MO      3
192            Lone Jack, MO      3
193                 Cuba, MO      3
194                Lenox, MO      3
195           High Point, MO      3
196               McGirk, MO      3
197            Cupertino, CA      3
198              Everton, MO      3
199           Hallsville, MO      3
200         Redwood City, CA      3
201               Hurley, MO      3
202              Elkland, MO      3
203         Prairie Home, MO      3
204              Spokane, MO      3
205         Russellville, MO      3
206              Chamois, MO      3
207           Centerview, MO      3
208                Clark, MO      3
209               Corder, MO      3
210               Lawton, OK      2
211          Clarksville, TX      2
212             Republic, MO      2
213             Atchison, KS      2
215               Clever, MO      2
216                Salem, MO      2
217            Strafford, MO      2
218               Argyle, MO      2
219             Billings, MO      2
220               Dublin, CA      2
221        Pleasant Hope, MO      2
222        Highlandville, MO      2
223            Tahlequah, OK      2
224        Lake Lotawana, MO      2
225              Fayette, MO      2
226               Jerome, MO      2
227                Olean, MO      2
228            Strasburg, MO      2
229          Morrisville, MO      2
230             Halltown, MO      2
231          Marionville, MO      2
232           Burlingame, CA      2
233           Koeltztown, MO      2
234           Westphalia, MO      2
235         Holts Summit, MO      2
236               Lohman, MO      2
237             Lawrence, KS      2
238        Ponce De Leon, MO      2
239               Mokane, MO      2
240              Ivanhoe, TX      2
241             Sun City, KS      2
242             Marietta, OK      2
243           Tishomingo, OK      2
244            Concordia, MO      2
245               Durant, OK      2
246           Whitesboro, TX      2
247           Menlo Park, CA      2
248               Sparta, MO      2
249        Nichols Hills, OK      2
250            Daly City, CA      2
251             Pacifica, CA      2
252            San Mateo, CA      2
253             Cheyenne, OK      2
254            McAlester, OK      2
255          Santa Clara, CA      2
256          Green Ridge, MO      2
257           Pleasanton, CA      2
258              Denison, TX      2
259  South San Francisco, CA      2
260            Hollister, MO      1
261               Eudora, MO      1
262              Lincoln, MO      1
263           Wooldridge, MO      1
264                Paris, TX      1
265    Excelsior Springs, MO      1
266               Lawton, KS      1
267               Salina, KS      1
268              Ardmore, OK      1
269                  Box, OK      1
270                Mosby, MO      1
271              Hayward, CA      1
272                Ector, TX      1
273         Grain Valley, MO      1
274             Bellaire, KS      1
275            Grandview, MO      1
276          Eastborough, KS      1
277                Grove, OK      1
278                 Casa, AR      1
279        Mountain View, AR      1
280               Beloit, KS      1
281      Shawnee Mission, KS      1
282             Appleton, AR      1
283             Brighton, MO      1
284       Bonner Springs, KS      1
285               Windom, TX      1
286               Benton, AR      1
287              Newport, MO      1
288              Ravenna, TX      1
289             Pawhuska, OK      1
290               Prague, OK      1
291               Roxton, TX      1
292               Warner, OK      1
293            Frontenac, KS      1
294              Lacygne, KS      1
295           Bois D'Arc, MO      1
296        Castro Valley, CA      1
297             Richmond, CA      1
298             Sedgwick, KS      1
299               Novato, CA      1
300             Atherton, CA      1
301              Diggins, MO      1
303          Foster City, CA      1
304              Lemoore, CA      1
305                Riley, KS      1
306               Gentry, AR      1
307           Blairstown, MO      1
308               Henley, MO      1
309              Chanute, KS      1
310    North Kansas City, MO      1
311             Berryton, KS      1
312               Harrah, OK      1
314           Burlington, KS      1
315             Fairmont, OK      1
317              Lathrop, CA      1
318           Schoenchen, KS      1
319           Harrisburg, MO      1
320            San Ramon, CA      1
321               Moraga, CA      1
322               Albany, CA      1
323               Fresno, CA      1
324    New York Township, MO      1
325            Lexington, OK      1
326               Hunter, OK      1
327         Roeland Park, KS      1
328                Ozark, MO      1
329          Battlefield, MO      1
330              Raytown, MO      1
331           Santa Rosa, CA      1
332          Hot Springs, AR      1
333               Concho, OK      1
334               Nevada, MO      1
335         Arden-Arcade, CA      1
336              Shawnee, OK      1
337       Shawnee County, KS      1
338             Bismarck, AR      1
339            Chickasha, OK      1
340             Healdton, OK      1

In [12]:
#locations that were filtered out - for reference
filtered_location_df = location_df.drop(location_df[location_df['location'].str.contains(r'\w+,\s\w{2}')].index)
filtered_location_df

                       location  count
0                      Anywhere   4883
1                 United States   2280
11                     Missouri     72
32                     Oklahoma     13
45                                  11
59                       Kansas      9
77     United States (+1 other)      8
124   United States (+2 others)      5
214  United States (+25 others)      2
302   United States (+7 others)      1
313  United States (+10 others)      1
316   United States (+9 others)      1

In [ ]:
# closing the database connection
conn.close()